[
  {
    "title": "Rydex",
    "description": "Rydex is a comprehensive ride-hailing platform offering features like real-time tracking, multiple ride options, secure payments, and a Car on Rent feature.",
    "role": "As Lead Backend Developer, I was responsible for backend development of new features, optimizing system performance, and ensuring scalability. I focused on improving backend efficiency, streamlining processes, and enhancing the overall user experience, which directly contributed to the platform’s growth and product success.",
    "technologies-used": "Node.js, MongoDB, Express, Angular, Google Maps API, Socket.IO, Firebase Realtime Database.",
    "Achievements": "Improved backend performance and code quality, enhancing API efficiency by 40%, which directly contributed to an increase in product sales."
  },
  {
    "title": "MyCar",
    "description": "MyCar is a leading e-hailing platform in Malaysia, offering real-time tracking, multiple ride options, and secure payments.",
    "role": " the backend development for the MyCar project, cloning the Rydex code and handling the project setup. I managed deployment, configuration, and ongoing client communication. I also handled the implementation of required customizations and additional features based on client requirements.",
    "technologies-used": "MEAN Stack, Google Maps API, Socket.IO, Firebase Realtime Database, AWS EC2, AWS S3, GCP.",
    "Achievements": "Successfully deployed and customized the project, contributing to MyCar becoming one of Malaysia’s top e-hailing apps."
  },
  {
    "title": "Virk",
    "description": "Virk is a food delivery platform offering seamless ordering, real-time tracking, and secure payments, catering to customers and restaurants alike.",
    "role": "Led the backend development for the Virk food delivery project, cloning the code from an existing delivery product and handling the setup. I managed deployment, configuration, and client communication, implementing customizations and additional features based on client requirements.",
    "technologies-used": "MEAN Stack, Google Maps API, Socket.IO, Firebase Realtime Database, AWS EC2, AWS S3, GCP.",
    "Achievements": "Successfully deployed and customized the project, contributing to the successful operation of Virk in the competitive food delivery market."
  }
]